# ####################################################################

#  Created by Genus Synthesis Solution 15.10-s019_1 on Thu Oct 10 15:40:05 +0600 2019

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design proccessor

create_clock -name "clock" -add -period 2.0 -waveform {0.0 1.0} [get_ports clk]
set_clock_transition 0.3 [get_clocks clock]
set_load -pin_load 0.5 [get_ports {result[7]}]
set_load -pin_load 0.5 [get_ports {result[6]}]
set_load -pin_load 0.5 [get_ports {result[5]}]
set_load -pin_load 0.5 [get_ports {result[4]}]
set_load -pin_load 0.5 [get_ports {result[3]}]
set_load -pin_load 0.5 [get_ports {result[2]}]
set_load -pin_load 0.5 [get_ports {result[1]}]
set_load -pin_load 0.5 [get_ports {result[0]}]
set_load -pin_load 0.5 [get_ports {OUT1[7]}]
set_load -pin_load 0.5 [get_ports {OUT1[6]}]
set_load -pin_load 0.5 [get_ports {OUT1[5]}]
set_load -pin_load 0.5 [get_ports {OUT1[4]}]
set_load -pin_load 0.5 [get_ports {OUT1[3]}]
set_load -pin_load 0.5 [get_ports {OUT1[2]}]
set_load -pin_load 0.5 [get_ports {OUT1[1]}]
set_load -pin_load 0.5 [get_ports {OUT1[0]}]
set_load -pin_load 0.5 [get_ports {OUT2[7]}]
set_load -pin_load 0.5 [get_ports {OUT2[6]}]
set_load -pin_load 0.5 [get_ports {OUT2[5]}]
set_load -pin_load 0.5 [get_ports {OUT2[4]}]
set_load -pin_load 0.5 [get_ports {OUT2[3]}]
set_load -pin_load 0.5 [get_ports {OUT2[2]}]
set_load -pin_load 0.5 [get_ports {OUT2[1]}]
set_load -pin_load 0.5 [get_ports {OUT2[0]}]
set_load -pin_load 0.5 [get_ports {Data2[7]}]
set_load -pin_load 0.5 [get_ports {Data2[6]}]
set_load -pin_load 0.5 [get_ports {Data2[5]}]
set_load -pin_load 0.5 [get_ports {Data2[4]}]
set_load -pin_load 0.5 [get_ports {Data2[3]}]
set_load -pin_load 0.5 [get_ports {Data2[2]}]
set_load -pin_load 0.5 [get_ports {Data2[1]}]
set_load -pin_load 0.5 [get_ports {Data2[0]}]
set_load -pin_load 0.5 [get_ports {mux1out[7]}]
set_load -pin_load 0.5 [get_ports {mux1out[6]}]
set_load -pin_load 0.5 [get_ports {mux1out[5]}]
set_load -pin_load 0.5 [get_ports {mux1out[4]}]
set_load -pin_load 0.5 [get_ports {mux1out[3]}]
set_load -pin_load 0.5 [get_ports {mux1out[2]}]
set_load -pin_load 0.5 [get_ports {mux1out[1]}]
set_load -pin_load 0.5 [get_ports {mux1out[0]}]
set_load -pin_load 0.5 [get_ports {immediate[7]}]
set_load -pin_load 0.5 [get_ports {immediate[6]}]
set_load -pin_load 0.5 [get_ports {immediate[5]}]
set_load -pin_load 0.5 [get_ports {immediate[4]}]
set_load -pin_load 0.5 [get_ports {immediate[3]}]
set_load -pin_load 0.5 [get_ports {immediate[2]}]
set_load -pin_load 0.5 [get_ports {immediate[1]}]
set_load -pin_load 0.5 [get_ports {immediate[0]}]
set_load -pin_load 0.5 [get_ports {mux2out[7]}]
set_load -pin_load 0.5 [get_ports {mux2out[6]}]
set_load -pin_load 0.5 [get_ports {mux2out[5]}]
set_load -pin_load 0.5 [get_ports {mux2out[4]}]
set_load -pin_load 0.5 [get_ports {mux2out[3]}]
set_load -pin_load 0.5 [get_ports {mux2out[2]}]
set_load -pin_load 0.5 [get_ports {mux2out[1]}]
set_load -pin_load 0.5 [get_ports {mux2out[0]}]
set_load -pin_load 0.5 [get_ports {Select[2]}]
set_load -pin_load 0.5 [get_ports {Select[1]}]
set_load -pin_load 0.5 [get_ports {Select[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clock] -network_latency_included -add_delay -rise -min 0.0 [get_ports clk]
set_input_delay -clock [get_clocks clock] -clock_fall -network_latency_included -add_delay -fall -min 0.0 [get_ports clk]
set_input_delay -add_delay -max 0.5 [get_ports clk]
set_input_delay -add_delay -max 0.5 [get_ports reset]
set_output_delay -add_delay -max 0.5 [get_ports {result[7]}]
set_output_delay -add_delay -max 0.5 [get_ports {result[6]}]
set_output_delay -add_delay -max 0.5 [get_ports {result[5]}]
set_output_delay -add_delay -max 0.5 [get_ports {result[4]}]
set_output_delay -add_delay -max 0.5 [get_ports {result[3]}]
set_output_delay -add_delay -max 0.5 [get_ports {result[2]}]
set_output_delay -add_delay -max 0.5 [get_ports {result[1]}]
set_output_delay -add_delay -max 0.5 [get_ports {result[0]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT1[7]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT1[6]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT1[5]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT1[4]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT1[3]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT1[2]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT1[1]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT1[0]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT2[7]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT2[6]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT2[5]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT2[4]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT2[3]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT2[2]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT2[1]}]
set_output_delay -add_delay -max 0.5 [get_ports {OUT2[0]}]
set_output_delay -add_delay -max 0.5 [get_ports {Data2[7]}]
set_output_delay -add_delay -max 0.5 [get_ports {Data2[6]}]
set_output_delay -add_delay -max 0.5 [get_ports {Data2[5]}]
set_output_delay -add_delay -max 0.5 [get_ports {Data2[4]}]
set_output_delay -add_delay -max 0.5 [get_ports {Data2[3]}]
set_output_delay -add_delay -max 0.5 [get_ports {Data2[2]}]
set_output_delay -add_delay -max 0.5 [get_ports {Data2[1]}]
set_output_delay -add_delay -max 0.5 [get_ports {Data2[0]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux1out[7]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux1out[6]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux1out[5]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux1out[4]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux1out[3]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux1out[2]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux1out[1]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux1out[0]}]
set_output_delay -add_delay -max 0.5 [get_ports {immediate[7]}]
set_output_delay -add_delay -max 0.5 [get_ports {immediate[6]}]
set_output_delay -add_delay -max 0.5 [get_ports {immediate[5]}]
set_output_delay -add_delay -max 0.5 [get_ports {immediate[4]}]
set_output_delay -add_delay -max 0.5 [get_ports {immediate[3]}]
set_output_delay -add_delay -max 0.5 [get_ports {immediate[2]}]
set_output_delay -add_delay -max 0.5 [get_ports {immediate[1]}]
set_output_delay -add_delay -max 0.5 [get_ports {immediate[0]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux2out[7]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux2out[6]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux2out[5]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux2out[4]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux2out[3]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux2out[2]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux2out[1]}]
set_output_delay -add_delay -max 0.5 [get_ports {mux2out[0]}]
set_output_delay -add_delay -max 0.5 [get_ports {Select[2]}]
set_output_delay -add_delay -max 0.5 [get_ports {Select[1]}]
set_output_delay -add_delay -max 0.5 [get_ports {Select[0]}]
set_max_fanout 10.000 [current_design]
set_max_transition 2.0 [current_design]
set_operating_conditions slow
set_driving_cell -lib_cell BUFX2 -library gpdk045bc -pin "Y" [get_ports clk]
set_driving_cell -lib_cell BUFX2 -library gpdk045bc -pin "Y" [get_ports reset]
set_dont_use [get_lib_cells gpdk045bc/HOLDX1]
set_clock_uncertainty -setup 0.35 [get_clocks clock]
set_clock_uncertainty -hold 0.3 [get_clocks clock]
